{
    "modelTopology": {
      "class_name": "Sequential",
      "config": [
        {
          "class_name": "Dense",
          "config": {
            "units": 24,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_layer_1",
            "trainable": true,
            "batch_input_shape": [null, 6],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 12,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_layer_2",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 2,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "output_layer",
            "trainable": true
          }
        }
      ],
      "keras_version": "tfjs-layers 1.1.0",
      "backend": "tensor_flow.js"
    },
    "format": "layers-model",
    "generatedBy": "TensorFlow.js tfjs-layers v1.1.0",
    "convertedBy": null,
    "weightsManifest": [
      {
        "paths": ["./model-1.weights.bin"],
        "weights": [
          {
            "name": "dense_layer_1/kernel",
            "shape": [6, 24],
            "dtype": "float32"
          },
          {
            "name": "dense_layer_1/bias",
            "shape": [24],
            "dtype": "float32"
          },
          {
            "name": "dense_layer_2/kernel",
            "shape": [24, 12],
            "dtype": "float32"
          },
          {
            "name": "dense_layer_2/bias",
            "shape": [12],
            "dtype": "float32"
          },
          {
            "name": "output_layer/kernel",
            "shape": [12, 2],
            "dtype": "float32"
          },
          {
            "name": "output_layer/bias",
            "shape": [2],
            "dtype": "float32"
          }
        ]
      }
    ]
  }
  