{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Dense","config":{"units":12,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense8401","trainable":true,"batch_input_shape":[null,6],"dtype":"float32"}},{"class_name":"Dense","config":{"units":6,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense8402","trainable":true}},{"class_name":"Dense","config":{"units":2,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense8403","trainable":true}}],"keras_version":"tfjs-layers 1.1.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.1.0","convertedBy":null,"weightsManifest":[{"paths":["./model7.weights.bin"],"weights":[{"name":"dense_Dense8401/kernel","shape":[6,12],"dtype":"float32"},{"name":"dense_Dense8401/bias","shape":[12],"dtype":"float32"},{"name":"dense_Dense8402/kernel","shape":[12,6],"dtype":"float32"},{"name":"dense_Dense8402/bias","shape":[6],"dtype":"float32"},{"name":"dense_Dense8403/kernel","shape":[6,2],"dtype":"float32"},{"name":"dense_Dense8403/bias","shape":[2],"dtype":"float32"}]}]}