{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Dense","config":{"units":12,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense93133","trainable":true,"batch_input_shape":[null,6],"dtype":"float32"}},{"class_name":"Dense","config":{"units":6,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense93134","trainable":true}},{"class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense93135","trainable":true}},{"class_name":"Dense","config":{"units":2,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense93136","trainable":true}}],"keras_version":"tfjs-layers 1.1.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.1.0","convertedBy":null,"weightsManifest":[{"paths":["./model9.weights.bin"],"weights":[{"name":"dense_Dense93133/kernel","shape":[6,12],"dtype":"float32"},{"name":"dense_Dense93133/bias","shape":[12],"dtype":"float32"},{"name":"dense_Dense93134/kernel","shape":[12,6],"dtype":"float32"},{"name":"dense_Dense93134/bias","shape":[6],"dtype":"float32"},{"name":"dense_Dense93135/kernel","shape":[6,4],"dtype":"float32"},{"name":"dense_Dense93135/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense93136/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense93136/bias","shape":[2],"dtype":"float32"}]}]}