{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Dense","config":{"units":18,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4099","trainable":true,"batch_input_shape":[null,6],"dtype":"float32"}},{"class_name":"Dense","config":{"units":3,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4100","trainable":true}},{"class_name":"Dense","config":{"units":2,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4101","trainable":true}}],"keras_version":"tfjs-layers 1.1.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.1.0","convertedBy":null,"weightsManifest":[{"paths":["./model-2.weights.bin"],"weights":[{"name":"dense_Dense4099/kernel","shape":[6,18],"dtype":"float32"},{"name":"dense_Dense4099/bias","shape":[18],"dtype":"float32"},{"name":"dense_Dense4100/kernel","shape":[18,3],"dtype":"float32"},{"name":"dense_Dense4100/bias","shape":[3],"dtype":"float32"},{"name":"dense_Dense4101/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense4101/bias","shape":[2],"dtype":"float32"}]}]}